let predictions =
    [
        "Незабаром на вашому шляху з'явиться нова та захоплююча можливість",
        "Ваша наполеглива праця та цілеспрямованість приведуть до великого успіху",
        "Неочікувані фінансові прибутки на горизонті",
        "Ви зустрінете когось, хто сильно вплине на ваше життя",
        "Важливе рішення, яке ви приймете сьогодні, позитивно вплине на ваше майбутнє",
        "Нові пригоди чекають на вас у найближчі місяці",
        "Ваші творчі ідеї будуть визнані та відзначені",
        "Давнє бажання або мрія нарешті здійсниться",
        "Ви подолаєте складну перешкоду і станете сильнішими, ніж будь-коли",
        "Кохана людина здивує вас особливим жестом доброти",
        "Ваша інтуїція допоможе вам зробити правильний вибір",
        "Позитивні зміни у вашій кар'єрі приведуть до більшої реалізації",
        "Ви отримаєте несподівану підтримку від близької вам людини",
        "Подорож до нового місця розширить ваші перспективи",
        "Ваш позитивний світогляд приверне достаток у ваше життя",
        "Минула помилка навчить вас цінним урокам на майбутнє",
        "Ви знайдете внутрішній спокій і рівновагу посеред хаосу",
        "Старий друг відновить зв’язок з вами, повернувши дорогі спогади",
        "Ваша рішучість і наполегливість приведуть до великого досягнення",
        "Ви на шляху до відкриття своєї справжньої мети в житті",
        "Вам випаде унікальна можливість розкрити свій потенціал",
        "Ваша енергія та воля допоможуть вам перемогти будь-які перешкоди",
        "У вашому житті з'явиться новий талант, який принесе вам радість і задоволення",
        "Ваші старання будуть винагороджені великим успіхом і визнанням",
        "Ви знайдете нову любов у своєму житті, яка принесе вам безмежну щастя",
        "Вам відкриються нові горизонти в освіті, що розширять ваші знання",
        "Ви здивуєте всіх своїх оточуючих своїм творчим потенціалом",
        "У вас з'явиться можливість зробити важливу подорож, яка змінить ваше бачення світу",
        "Ваші дії та впевненість в собі здивують навіть вас самого",
        "Ви отримаєте несподівану нагороду за свої досягнення",
        "Ваші ідеї та інновації здобудуть широке визнання від фахівців у вашій галузі",
        "Ви зробите вагомий внесок у справу, яка має велике значення для вас і для оточуючих",
        "У вас з'явиться надійний партнер, з яким ви будете досягати спільних цілей",
        "Ваші творчі здібності призведуть до створення чогось незабутнього і виразного",
        "Ви перетворите свої страхи на сили і зумієте досягти неможливого",
        "Ви зробите важливий прорив у своїй кар'єрі, що принесе вам нові можливості",
        "Ваша наступність та цілеспрямованість зроблять вас прикладом для інших",
        "Ви зустрінете мудрого наставника, який надасть вам цінні поради",
        "Ваші добрі справи та внесок в суспільство принесуть вам глибоке задоволення",
        "Ви здійсните велику перемогу над своїми внутрішніми перешкодами",
        "Ваші зусилля у вивченні нової мови або культури приведуть до незабутніх досвідів",
        "Ви отримаєте запрошення відомої особи для співпраці або спільного проекту",
        "Ваша доброта та чуйність допоможуть вам підтримати когось у важкий момент",
        "Ви знайдете нову хобі або захоплення, яке запалить вашу страсть",
        "Ваші творчі рішення будуть високо оцінені в професійному середовищі",
        "Вам довірять важлива посада або відповідальне завдання",
        "Ви зустрінете людину, яка відкриє вам новий світ можливостей",
        "Ваша настійливість та витримка приведуть вас до досягнення великого успіху",
        "Ви знайдете глибоке задоволення у виконанні своїх мрій та бажань",
        "Ваша сміливість та рішучість збудять вам нові можливості для особистого росту"
    ];
function getRandomPrediction() {
    return predictions[Math.floor(Math.random() * predictions.length)];
}

let predictionElement = document.getElementById("prediction");
let typingInterval = 50;
let typingSpeed = 1;
let typingTimeout = null;

function typePrediction(prediction) {
    let currentLength = predictionElement.textContent.length;
    let nextChar = prediction.charAt(currentLength);

    if (currentLength < prediction.length) {
        predictionElement.textContent += nextChar;
        typingTimeout = setTimeout(function() {
            typePrediction(prediction);
        }, typingInterval);
    }
}

function displayRandomPrediction() {
    predictionElement.textContent = "";
    let randomPrediction = getRandomPrediction();
    typePrediction(randomPrediction);
}
displayRandomPrediction();