<!DOCTYPE html>
<html lang="en">
<head>
    <title>Інформація</title>
    <link rel="icon" type="png" href="../static/images/category/icon.png">
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <link rel="stylesheet" href="/static/css/inform.css">
</head>
<body>
<div class="container">
    <h1>Оплата та доставка</h1>
    <div class="card">
        <h2>Оплата карткою</h2>
        <p>Можливість оплати замовлення банківською карткою. Зручний та безпечний спосіб оплати онлайн.</p>
        <a class="expand-btn" onclick="toggleAdditionalInfo(this)">Докладніше</a>
        <p class="additional-info">
            <br>
            Наш магазин приймає оплату замовлень за допомогою різних видів банківських карток, включаючи Visa, Mastercard,<br>
            American Express та багато інших.<br><br>
            Вам потрібно буде ввести наступну інформацію:<br>
            <br>
            * Номер картки<br>
            * CVV-код<br>
            * Термін дії картки
            <br><br>
            Всі платежі проводяться через захищений протокол шифрування, що забезпечує конфіденційність та безпеку вашої інформації.
        </p>
    </div>
    <div class="card">
        <h2>Оплата готівкою</h2>
        <p>Можливість оплати замовлення готівкою при отриманні.</p>
        <a class="expand-btn" onclick="toggleAdditionalInfo(this)">Докладніше</a>
        <p class="additional-info">
            <br>
            При оформленні замовлення через ваш веб-сайт або мобільний додаток, <br>
            користувачі матимуть можливість вибрати спосіб оплати "готівка при отриманні". <br>
            Після підтвердження замовлення і вибору способу оплати готівкою, <br>
            кур'єр, представник ресторану або третя стСторона, відповідальна за доставку, буде надіслана до вказаної
            адреси замовлення. <br><br>
            При доставці замовлення кур'єру слід мати при собі достатню кількість готівки для здійснення оплати. <br>
            Рекомендується мати точну суму, щоб уникнути непорозумінь або затримок. <br>
            Коли кур'єр доставить замовлення, клієнт може передати готівку кур'єру в обмін на замовлені страви. <br><br>
            Після отримання готівки, кур'єр або представник ресторану повинен підтвердити <br>
            оплату готівкою і видається квитанція або розписка клієнту як доказ оплати. <br>
            Цей спосіб оплати дозволяє клієнтам сплатити за замовлення безпосередньо кур'єру <br>
            при отриманні їхнього замовлення, забезпечуючи зручність та гнучкість оплати.
        </p>
    </div>
    <div class="card">
        <h2>Доставка</h2>
        <p>Доставка здійснюється за допомогою служби Bolt Food</p>
        <a class="expand-btn" onclick="toggleAdditionalInfo(this)">Докладніше</a>
        <p class="additional-info">
            <br>
            Користувачі, оформлюючи замовлення через ваш веб-сайт або мобільний додаток, можуть вибрати доставку за
            допомогою Bolt Food.<br><br>
            При виборі цього варіанту доставки, користувачі будуть перенаправлені на платіжний шлюз Bolt Food для
            здійснення оплати.<br><br>
            Після успішного платежу, Bolt Food забезпечить доставку замовлення до вказаної адреси, а клієнт отримає
            повідомлення про час доставки.
        </p>
    </div>
    <a class="btn btn-outline-primary" href="/">Назад</a>
</div>


<script src="/static/js/inform.js">

</script>

</body>
</html>